[
  {
    "period": "2021 - Present",
    "role": "Senior Data Engineer - Asset Custody Services",
    "company": "Itaú Unibanco",
    "logo": "assets/images/itau_logo.jpg",
    "description": "Leading a team of data engineers in designing and implementing scalable data platforms. Architecting cloud-based data solutions on AWS and GCP, optimizing data pipelines, and establishing data governance practices. Reduced processing costs by 35% while increasing data throughput.",
    "highlights": [
      "Led a team of 5 data engineers across 3 major projects",
      "Reduced cloud infrastructure costs by 35% while improving performance",
      "Implemented data governance framework adopted company-wide"
    ],
    "technologies": ["AWS", "GCP", "Python", "Terraform", "Spark", "Airflow"]
  },
  {
    "period": "2019 - 2021",
    "role": "Senior Data Engineer - Fraud Prevention",
    "company": "Itaú Unibanco",
    "logo": "assets/images/itau_logo.jpg",
    "description": "Developed and maintained data pipelines using Apache Airflow, Spark, and Kafka. Built real-time streaming solutions for high-volume data processing. Collaborated with data scientists to implement ML models in production environments.",
    "highlights": [
      "Architected real-time streaming pipeline processing 50M+ events daily",
      "Reduced data processing time from hours to seconds",
      "Built data quality monitoring framework with automated alerts"
    ],
    "technologies": ["Apache Kafka", "PySpark", "Airflow", "Python", "SQL", "Docker"]
  },
  {
    "period": "2017 - 2019",
    "role": "Data Analyst",
    "company": "Global Insights Corp",
    "logo": "assets/images/company-global-insights.png",
    "description": "Created data visualizations and dashboards for business metrics using Tableau and PowerBI. Wrote complex SQL queries for data analysis and reporting. Automated reporting workflows, saving over 20 hours of manual work weekly.",
    "highlights": [
      "Created executive dashboards used by C-level management for decision making",
      "Automated weekly reports saving 20+ hours of manual work",
      "Developed ad-hoc analysis tools for the marketing department"
    ],
    "technologies": ["SQL", "Tableau", "PowerBI", "Excel", "Python", "R"]
  }
] 